Section 9: Running Programs from the Command Line/Section 9.tex
% Created 2021-08-03 Tue 19:34
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mohammed Asir Shahid}
\date{2021-08-03}
\title{Section 9\\\medskip
\large Running Programs from the Command Line}
\hypersetup{
 pdfauthor={Mohammed Asir Shahid},
 pdftitle={Section 9},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Launching Python Programs from Outside IDLE}
\label{sec:org8e0ce82}

Opening your IDE, then opening the program, and then running it is time consuming and not convenient. You can instead run it from the terminal, but the way to do this differs based on your operating system.

\subsection{Shebang Line}
\label{sec:orgef1f61d}

The shebang line should be the first line in your Python programs. In Linux it is


\begin{verbatim}
#! /usr/bin/python3
\end{verbatim}

\subsection{The Terminal}
\label{sec:org23e5d60}

Next you must open up a terminal, run python and then give the path to the file you want to run.


The rest of the lesson is Windows specific.
\end{document}
