Section 9: Running Programs from the Command Line/Section 9.md

# Table of Contents

1.  [Launching Python Programs from Outside IDLE](#orgedccc46)
    1.  [Shebang Line](#org19f556b)
    2.  [The Terminal](#org7f44a64)



<a id="orgedccc46"></a>

# Launching Python Programs from Outside IDLE

Opening your IDE, then opening the program, and then running it is time consuming and not convenient. You can instead run it from the terminal, but the way to do this differs based on your operating system.


<a id="org19f556b"></a>

## Shebang Line

The shebang line should be the first line in your Python programs. In Linux it is

    #! /usr/bin/python3


<a id="org7f44a64"></a>

## The Terminal

Next you must open up a terminal, run python and then give the path to the file you want to run.

The rest of the lesson is Windows specific.

